package javaStart.lesson7.level2;

public class ex1 {
//    «Перевернуть массив». Т.е. написать программу которая повернет
//    базовый массив на 90,180,270 градусов по часовой стрелке. (При
//    выполнении задания использовать дополнительный массив нельзя). В
//    примере показан поворот на 90 градусов - (3 часа)


    public static void main(String[] args) {
        int[][] a = {
                {1,1,1,1,1},
                {2,2,2,2,2},
                {3,3,3,3,3},
                {4,4,4,4,4},
                {5,5,5,5,5}};
    }

    private int[][] getRotate90Array(int[][] array) {

        return new int[7][];
    }

}
